# '''
#             Линукс команды
# '''
# 1. pwd (print working directory) -> возвращает абсолютный путь (показывает
#  где мы сейчас находимся)
# 2. ls (list) -> возвращает список всех файлов и директорий  (в текущей) 
# 	ls dir_name -> выводит список содержимого директории dir_name
# 	ls -a -> выводит все содержимое включая скрытые файли и папки
# 	ls -l -> выводит список с подробной информацией
# 	ls -la -> выводит список со скрытыми файлами и их подробная инфо
# 3. cd (change directory) -> перемещает в определенную директорию
# 	cd dir_name
# 	cd или  cd ~ -> переход в домашнюю директорию
# 	cd .. или cd - -> переход на директорию выше (вернутся к предыдущей директории)
# 	cd / -> переход в корненую директорию
# 4. mkdir dirname -> создает директорию с названием dirname
# 5. touch filename -> создает файл 
# (4 и 5 -> можно создать несколько, перечислив названия через пробел)
# 6. rm -> удаление файла
# 7. rmdir -> удаление пустой директории
# 8. rm -rf (remove -recursive force) -> удаление директории с содержимым 
# (рекурсивное удаление)
# 9. nano -> открывает/создает файл в текстовом редакторе 1(CTRL + s, CTRL + x)
# 	2.(CTRL + x, Y, Enter)
# 10. cat -> выводит содержимое файла в терминал
# 	cat filename or text > filename2 -> записывает содержимое filename или text
# 	в filename2
# 11. echo -> записывает текст в файл (echo hello > filename)
# 12. mv (move) -> перемещает/переименовывает  файл/директорию
# 	mv filename new_filaname  переименовывание
# 	mv filename dirname перемещение
# 13. cp (copy) -> копирует файл в какуюто директорию
# 	cp filename dirname
# 14. du -> выводит размер занимаемой памяти
# 15. sudo -> утилита, предоставляющая права админа
# 16. find -> используется для поиска файлов или директорий, возвращает абсолютный
# 	 путь до них
# 17. clear -> очищает терминал
# 18. history -> выводит историю использованных команд
# 19. exit -> закрывает терминал


































